#read design
read_verilog Sumador4Bits.v

#High Level Stuff
proc; opt

#mapping for internal library
techmap; opt

#mapping flip-flops to cmos_cells.lib
dfflibmap -liberty ./cmos_cells.lib

#mapping logic to cmos_cells.lib
abc -liberty ./cmos_cells.lib

#Generate Graph

show

#cleanup
clean 

#write synthesized design
write_verilog Sumador4Synth.v
